switched to using mermaid instead of plantuml
